XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Geehy.APM32F035_DFP.pdsc
<?xml version="1.0"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.0" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <url>https://www.geehy.com/uploads/tool/</url>
    <supportContact>https://www.geehy.com/support/apm</supportContact>
    <name>APM32F035_DFP</name>
    <description>Geehy Semiconductor APM32F035 Series Device Support</description>
    <releases>
        <release version="1.0.0" date="2022-12-06">
            First Release version of APM32F035 Device Family Pack.
        </release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32F035</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32F035 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
            <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
            <description>
                Geehy Semiconductor' APM32F035 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M0+ core, with a maximum operating frequency of 72MHz.
                Core
                - ARM 32-bit Cortex-M0+ CPU (72 MHz max)
                Memories
                - 64 Kbytes of Flash memory
                - 8 Kbytes of SRAM with HW parity checking
                M0CP coprocessor unit
                CRC calculation unit
                Reset and power management
                - Voltage range: 2.0 V to 3.6 V
                - Power-on/Power down reset (POR/PDR)
                - Low power modes: Sleep, Stop, Standby
                Clock management
                - 4 to 32 MHz crystal oscillator
                - 32 kHz oscillator for RTC with calibration
                - Internal 8 MHz RC with x6 PLL option
                - Internal 40 kHz RC oscillator

            </description>
            <!-- ******************************  APM32F035  ****************************** -->
            <subFamily DsubFamily="APM32F035">
                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="CAN" n="1"/>
                <!-- ******************************  APM32F035C8  ****************************** -->
                <device Dname="APM32F035C8">
                    <processor Dclock="72000000"/>
                    <compile header="Device/Device/Geehy/APM32F035/Include/apm32f035.h" define="APM32F035X8"/>
                    <debug svd="SVD/APM32F035.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F035_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F035 Data Sheet"/>
                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="2" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="39" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="1" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="2" name="USART Interface"/>
                </device>
            </subFamily>
        </family>
    </devices>
    <conditions>
        <!-- conditions are dependecy rules that can apply to a component or an individual file -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F035">
            <description>Geehy Semiconductor APM32F035 Series devices</description>
            <require Dname="APM32F035C8"/>
        </condition>
        <condition id="APM32F035 ARMCC">
            <description>filter for APM32F035 Device and the ARM compiler</description>
            <require condition="APM32F035"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F035 CMSIS">
            <description>Geehy Semiconductor APM32F035 Device with CMSIS</description>
            <require condition="APM32F035"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
            <require Dvendor="Geehy:163" Dname="APM32F035C8"/>
        </condition>
        <condition id="APM32F035 STDPERIPH">
            <description>Geehy Semiconductor APM32F035 with Standard Peripherals Drivers Framework</description>
            <require condition="APM32F035 CMSIS"/>
            <require Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32F035 STDPERIPH RCM">
            <description>Geehy Semiconductor APM32F035 with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32F035 CMSIS"/>
            <require Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="APM32F035 Startup" Cversion="1.0.0" condition="APM32F035 CMSIS">
            <!-- Cversion is necessary -->
            <description>System Startup for Geehy Semiconductor APM32F035 Series</description>
            <files>
                <!-- include folder -->
                <file category="include" name="Device/CMSIS/Include/"/>
                <file category="include" name="Device/Device/Geehy/APM32F035/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32F035/Source/arm/startup_apm32f035.s" attr="config" version="1.0.0" condition="APM32F035 ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32F035/Source/system_apm32f035.c" attr="config" version="1.0.0"/>
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/APM32F035_StdPeriphDriver/inc/"/>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_misc.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_misc.c"/>
                <file category="header" name="Device/Templates/inc/apm32f035_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/src/apm32f035_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_adc.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_can.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="COMP" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Comparator (COMP) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_COMP </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_comp.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_comp.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="APM32F035 STDPERIPH ">
            <description>CRC calculation unit (CRC) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_crc.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="DBG" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBG</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_dbg.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_dbg.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_dma.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="EINT" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_eint.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="FMC" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>Flash memory controller driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_fmc.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_gpio.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="I2C" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_i2c.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="IWDT" Cversion="1.0.0" condition="APM32F035 STDPERIPH ">
            <description>Independent watchdog (IWDT) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_iwdt.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="PMU" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_pmu.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="RCM" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_rcm.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="APM32F035 STDPERIPH">
            <description>Real-Time Clock (RTC) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_rtc.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_rtc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_spi.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="TMR" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_tmr.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_usart.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="WWDT" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F035</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_wwdt.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_wwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="M0CP" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Coprocessor for the ARM cortex-M0+</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_M0CP</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_m0cp.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_m0cp.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="OPA" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Operational amplifier</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_OPA</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_opa.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_opa.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F035 StdPeriph Drivers" Csub="PUF" Cversion="1.0.0" condition="APM32F035 STDPERIPH RCM">
            <description>Physical non-clonable</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PUF</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F035_StdPeriphDriver/inc/apm32f035_puf.h"/>
                <file category="source" name="Device/APM32F035_StdPeriphDriver/src/apm32f035_puf.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32F035MINI" revision="Ver 1.0">
            <description>Geehy APM32F035 Development Board</description>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F035C8"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F035"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="3" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="SW"/>
        </board>
    </boards>
    <examples>
        <example name="APM32F035MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F035MINI/Blinky">
            <description>APM32F035_MINI  Blinky example</description>
            <board name="APM32F035MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F035MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
    </examples>
</package>
